case_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Legacy mesh file. The active case mesh is now generated from
// system/single_cylinder.geo and imported with gmshToFoam.

convertToMeters 1;

vertices
(
    (-1 -1 -0.005) // 0
    (-0.1 -1 -0.005) // 1
    (0 -1 -0.005) // 2
    (0.1 -1 -0.005) // 3
    (0.25 -1 -0.005) // 4
    (0.35 -1 -0.005) // 5
    (0.45 -1 -0.005) // 6
    (2.35 -1 -0.005) // 7
    (-1 -0.1 -0.005) // 8
    (-0.1 -0.1 -0.005) // 9
    (0 -0.1 -0.005) // 10
    (0.1 -0.1 -0.005) // 11
    (0.25 -0.1 -0.005) // 12
    (0.35 -0.1 -0.005) // 13
    (0.45 -0.1 -0.005) // 14
    (2.35 -0.1 -0.005) // 15
    (-1 0 -0.005) // 16
    (-0.1 0 -0.005) // 17
    (0 0 -0.005) // 18
    (0.1 0 -0.005) // 19
    (0.25 0 -0.005) // 20
    (0.35 0 -0.005) // 21
    (0.45 0 -0.005) // 22
    (2.35 0 -0.005) // 23
    (-1 0.1 -0.005) // 24
    (-0.1 0.1 -0.005) // 25
    (0 0.1 -0.005) // 26
    (0.1 0.1 -0.005) // 27
    (0.25 0.1 -0.005) // 28
    (0.35 0.1 -0.005) // 29
    (0.45 0.1 -0.005) // 30
    (2.35 0.1 -0.005) // 31
    (-1 1 -0.005) // 32
    (-0.1 1 -0.005) // 33
    (0 1 -0.005) // 34
    (0.1 1 -0.005) // 35
    (0.25 1 -0.005) // 36
    (0.35 1 -0.005) // 37
    (0.45 1 -0.005) // 38
    (2.35 1 -0.005) // 39
    (-0.0353553390593 0.0353553390593 -0.005) // 40
    (0 0.05 -0.005) // 41
    (0.0353553390593 0.0353553390593 -0.005) // 42
    (0.05 0 -0.005) // 43
    (0.0353553390593 -0.0353553390593 -0.005) // 44
    (0 -0.05 -0.005) // 45
    (-0.0353553390593 -0.0353553390593 -0.005) // 46
    (-0.05 0 -0.005) // 47
    (0.314644660941 0.0353553390593 -0.005) // 48
    (0.35 0.05 -0.005) // 49
    (0.385355339059 0.0353553390593 -0.005) // 50
    (0.4 0 -0.005) // 51
    (0.385355339059 -0.0353553390593 -0.005) // 52
    (0.35 -0.05 -0.005) // 53
    (0.314644660941 -0.0353553390593 -0.005) // 54
    (0.3 0 -0.005) // 55
    (-1 -1 0.005) // 56
    (-0.1 -1 0.005) // 57
    (0 -1 0.005) // 58
    (0.1 -1 0.005) // 59
    (0.25 -1 0.005) // 60
    (0.35 -1 0.005) // 61
    (0.45 -1 0.005) // 62
    (2.35 -1 0.005) // 63
    (-1 -0.1 0.005) // 64
    (-0.1 -0.1 0.005) // 65
    (0 -0.1 0.005) // 66
    (0.1 -0.1 0.005) // 67
    (0.25 -0.1 0.005) // 68
    (0.35 -0.1 0.005) // 69
    (0.45 -0.1 0.005) // 70
    (2.35 -0.1 0.005) // 71
    (-1 0 0.005) // 72
    (-0.1 0 0.005) // 73
    (0 0 0.005) // 74
    (0.1 0 0.005) // 75
    (0.25 0 0.005) // 76
    (0.35 0 0.005) // 77
    (0.45 0 0.005) // 78
    (2.35 0 0.005) // 79
    (-1 0.1 0.005) // 80
    (-0.1 0.1 0.005) // 81
    (0 0.1 0.005) // 82
    (0.1 0.1 0.005) // 83
    (0.25 0.1 0.005) // 84
    (0.35 0.1 0.005) // 85
    (0.45 0.1 0.005) // 86
    (2.35 0.1 0.005) // 87
    (-1 1 0.005) // 88
    (-0.1 1 0.005) // 89
    (0 1 0.005) // 90
    (0.1 1 0.005) // 91
    (0.25 1 0.005) // 92
    (0.35 1 0.005) // 93
    (0.45 1 0.005) // 94
    (2.35 1 0.005) // 95
    (-0.0353553390593 0.0353553390593 0.005) // 96
    (0 0.05 0.005) // 97
    (0.0353553390593 0.0353553390593 0.005) // 98
    (0.05 0 0.005) // 99
    (0.0353553390593 -0.0353553390593 0.005) // 100
    (0 -0.05 0.005) // 101
    (-0.0353553390593 -0.0353553390593 0.005) // 102
    (-0.05 0 0.005) // 103
    (0.314644660941 0.0353553390593 0.005) // 104
    (0.35 0.05 0.005) // 105
    (0.385355339059 0.0353553390593 0.005) // 106
    (0.4 0 0.005) // 107
    (0.385355339059 -0.0353553390593 0.005) // 108
    (0.35 -0.05 0.005) // 109
    (0.314644660941 -0.0353553390593 0.005) // 110
    (0.3 0 0.005) // 111
);

blocks
(
    hex (0 1 9 8 56 57 65 64) (36 30 1) simpleGrading (1 1 1)
    hex (8 9 17 16 64 65 73 72) (36 12 1) simpleGrading (1 1 1)
    hex (16 17 25 24 72 73 81 80) (36 12 1) simpleGrading (1 1 1)
    hex (24 25 33 32 80 81 89 88) (36 30 1) simpleGrading (1 1 1)
    hex (1 2 10 9 57 58 66 65) (12 30 1) simpleGrading (1 1 1)
    hex (25 26 34 33 81 82 90 89) (12 30 1) simpleGrading (1 1 1)
    hex (2 3 11 10 58 59 67 66) (12 30 1) simpleGrading (1 1 1)
    hex (26 27 35 34 82 83 91 90) (12 30 1) simpleGrading (1 1 1)
    hex (3 4 12 11 59 60 68 67) (10 30 1) simpleGrading (1 1 1)
    hex (11 12 20 19 67 68 76 75) (10 12 1) simpleGrading (1 1 1)
    hex (19 20 28 27 75 76 84 83) (10 12 1) simpleGrading (1 1 1)
    hex (27 28 36 35 83 84 92 91) (10 30 1) simpleGrading (1 1 1)
    hex (4 5 13 12 60 61 69 68) (12 30 1) simpleGrading (1 1 1)
    hex (28 29 37 36 84 85 93 92) (12 30 1) simpleGrading (1 1 1)
    hex (5 6 14 13 61 62 70 69) (12 30 1) simpleGrading (1 1 1)
    hex (29 30 38 37 85 86 94 93) (12 30 1) simpleGrading (1 1 1)
    hex (6 7 15 14 62 63 71 70) (60 30 1) simpleGrading (1 1 1)
    hex (14 15 23 22 70 71 79 78) (60 12 1) simpleGrading (1 1 1)
    hex (22 23 31 30 78 79 87 86) (60 12 1) simpleGrading (1 1 1)
    hex (30 31 39 38 86 87 95 94) (60 30 1) simpleGrading (1 1 1)
    hex (40 41 26 25 96 97 82 81) (12 10 1) simpleGrading (1 1 1)
    hex (41 42 27 26 97 98 83 82) (12 10 1) simpleGrading (1 1 1)
    hex (42 43 19 27 98 99 75 83) (12 10 1) simpleGrading (1 1 1)
    hex (43 44 11 19 99 100 67 75) (12 10 1) simpleGrading (1 1 1)
    hex (44 45 10 11 100 101 66 67) (12 10 1) simpleGrading (1 1 1)
    hex (45 46 9 10 101 102 65 66) (12 10 1) simpleGrading (1 1 1)
    hex (46 47 17 9 102 103 73 65) (12 10 1) simpleGrading (1 1 1)
    hex (47 40 25 17 103 96 81 73) (12 10 1) simpleGrading (1 1 1)
    hex (48 49 29 28 104 105 85 84) (12 10 1) simpleGrading (1 1 1)
    hex (49 50 30 29 105 106 86 85) (12 10 1) simpleGrading (1 1 1)
    hex (50 51 22 30 106 107 78 86) (12 10 1) simpleGrading (1 1 1)
    hex (51 52 14 22 107 108 70 78) (12 10 1) simpleGrading (1 1 1)
    hex (52 53 13 14 108 109 69 70) (12 10 1) simpleGrading (1 1 1)
    hex (53 54 12 13 109 110 68 69) (12 10 1) simpleGrading (1 1 1)
    hex (54 55 20 12 110 111 76 68) (12 10 1) simpleGrading (1 1 1)
    hex (55 48 28 20 111 104 84 76) (12 10 1) simpleGrading (1 1 1)
);

edges
(
    arc 40 41 (-0.0191341716183 0.0461939766256 -0.005)
    arc 96 97 (-0.0191341716183 0.0461939766256 0.005)
    arc 41 42 (0.0191341716183 0.0461939766256 -0.005)
    arc 97 98 (0.0191341716183 0.0461939766256 0.005)
    arc 42 43 (0.0461939766256 0.0191341716183 -0.005)
    arc 98 99 (0.0461939766256 0.0191341716183 0.005)
    arc 43 44 (0.0461939766256 -0.0191341716183 -0.005)
    arc 99 100 (0.0461939766256 -0.0191341716183 0.005)
    arc 44 45 (0.0191341716183 -0.0461939766256 -0.005)
    arc 100 101 (0.0191341716183 -0.0461939766256 0.005)
    arc 45 46 (-0.0191341716183 -0.0461939766256 -0.005)
    arc 101 102 (-0.0191341716183 -0.0461939766256 0.005)
    arc 46 47 (-0.0461939766256 -0.0191341716183 -0.005)
    arc 102 103 (-0.0461939766256 -0.0191341716183 0.005)
    arc 47 40 (-0.0461939766256 0.0191341716183 -0.005)
    arc 103 96 (-0.0461939766256 0.0191341716183 0.005)
    arc 48 49 (0.330865828382 0.0461939766256 -0.005)
    arc 104 105 (0.330865828382 0.0461939766256 0.005)
    arc 49 50 (0.369134171618 0.0461939766256 -0.005)
    arc 105 106 (0.369134171618 0.0461939766256 0.005)
    arc 50 51 (0.396193976626 0.0191341716183 -0.005)
    arc 106 107 (0.396193976626 0.0191341716183 0.005)
    arc 51 52 (0.396193976626 -0.0191341716183 -0.005)
    arc 107 108 (0.396193976626 -0.0191341716183 0.005)
    arc 52 53 (0.369134171618 -0.0461939766256 -0.005)
    arc 108 109 (0.369134171618 -0.0461939766256 0.005)
    arc 53 54 (0.330865828382 -0.0461939766256 -0.005)
    arc 109 110 (0.330865828382 -0.0461939766256 0.005)
    arc 54 55 (0.303806023374 -0.0191341716183 -0.005)
    arc 110 111 (0.303806023374 -0.0191341716183 0.005)
    arc 55 48 (0.303806023374 0.0191341716183 -0.005)
    arc 111 104 (0.303806023374 0.0191341716183 0.005)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 64 56)
            (8 16 72 64)
            (16 24 80 72)
            (24 32 88 80)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (7 15 71 63)
            (15 23 79 71)
            (23 31 87 79)
            (31 39 95 87)
        );
    }

    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 57 56)
            (1 2 58 57)
            (2 3 59 58)
            (3 4 60 59)
            (4 5 61 60)
            (5 6 62 61)
            (6 7 63 62)
        );
    }

    top
    {
        type symmetryPlane;
        faces
        (
            (32 33 89 88)
            (33 34 90 89)
            (34 35 91 90)
            (35 36 92 91)
            (36 37 93 92)
            (37 38 94 93)
            (38 39 95 94)
        );
    }

    cylinderWalls
    {
        type wall;
        faces
        (
            (40 41 97 96)
            (41 42 98 97)
            (42 43 99 98)
            (43 44 100 99)
            (44 45 101 100)
            (45 46 102 101)
            (46 47 103 102)
            (47 40 96 103)
            (48 49 105 104)
            (49 50 106 105)
            (50 51 107 106)
            (51 52 108 107)
            (52 53 109 108)
            (53 54 110 109)
            (54 55 111 110)
            (55 48 104 111)
        );
    }
);

defaultPatch
{
    name frontAndBack;
    type empty;
}

mergePatchPairs
(
);

// ************************************************************************* //