case_template/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver              GAMG;
        tolerance           1e-7;
        relTol              0.01;
        smoother            DICGaussSeidel;
        cacheAgglomeration  true;
        agglomerator        faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels         1;
    }

    "(U|k|omega)"
    {
        solver              smoothSolver;
        smoother            symGaussSeidel;
        tolerance           1e-8;
        relTol              0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent              yes;

    residualControl
    {
        p               1e-4;
        U               1e-5;
        "(k|omega)"     1e-5;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }

    equations
    {
        U               0.7;
        "(k|omega)"     0.7;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
